app/controllers/api/v1/projects_controller.rb

    def create
        @project = Project.create(check_params)
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Clean house"], ["description", "House errands "], ["created_at", "2020-01-21 19:26:56.521913"], ["updated_at", "2020-01-21 19:26:56.521913"]]