app/controllers/api/v1/tasks_controller.rb

    def index
        @tasks = Task.where(project_id: params[:project_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 2]]